wickkid/rt-thread/bsp/stm32h743-cllp/drivers/lan8742a.c
	/* Configure PA1, PA2 and PA7 */
	GPIO_InitStructure.Speed = GPIO_SPEED_FREQ_HIGH;
	GPIO_InitStructure.Mode = GPIO_MODE_AF_PP;
	GPIO_InitStructure.Pull = GPIO_NOPULL; 
	GPIO_InitStructure.Alternate = GPIO_AF11_ETH;
	GPIO_InitStructure.Pin = GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_7;
	HAL_GPIO_Init(GPIOA, &GPIO_InitStructure);

	/* Configure PB13 */
	GPIO_InitStructure.Pin = GPIO_PIN_13;
	HAL_GPIO_Init(GPIOB, &GPIO_InitStructure);

	/* Configure PC1, PC4 and PC5 */
	GPIO_InitStructure.Pin = GPIO_PIN_1 | GPIO_PIN_4 | GPIO_PIN_5;
	HAL_GPIO_Init(GPIOC, &GPIO_InitStructure);

	/* Configure PG2, PG11, PG13 and PG14 */
	GPIO_InitStructure.Pin =  /*GPIO_PIN_2 | */GPIO_PIN_11 | GPIO_PIN_13;
	HAL_GPIO_Init(GPIOG, &GPIO_InitStructure);	

	/* Enable the Ethernet global Interrupt */
	HAL_NVIC_SetPriority(ETH_IRQn, 0x7, 0);
	HAL_NVIC_EnableIRQ(ETH_IRQn);

	/* Enable Ethernet clocks */
	__HAL_RCC_ETH1MAC_CLK_ENABLE();
	__HAL_RCC_ETH1TX_CLK_ENABLE();
	__HAL_RCC_ETH1RX_CLK_ENABLE();
}

/**
  * @brief  Initialize the lan8742 and configure the needed hardware resources
  * @param  void. 
  * @retval LAN8742_STATUS_OK  if OK
  *         LAN8742_STATUS_ADDRESS_ERROR if cannot find device address
  *         LAN8742_STATUS_READ_ERROR if connot read register
  *         LAN8742_STATUS_WRITE_ERROR if connot write to register
  *         LAN8742_STATUS_RESET_TIMEOUT if cannot perform a software reset
  */
static int32_t LAN8742_Init(lan8742_Object_t *pObj)
{
	uint32_t tickstart = 0, regvalue = 0, addr = 0;
	int32_t status = LAN8742_STATUS_OK;
	
	if(pObj->Is_Initialized == 0)
	{
		if(pObj->IO.Init != 0)
		{
			/* GPIO and Clocks initialization */
			pObj->IO.Init();
		}

		/* for later check */
		pObj->DevAddr = LAN8742_MAX_DEV_ADDR + 1;

		/* Get the device address from special mode register */  
		for(addr = 0; addr <= LAN8742_MAX_DEV_ADDR; addr ++)
		{
			if(pObj->IO.ReadReg(addr, LAN8742_REG_SMR, &regvalue) < 0)
			{ 
				status = LAN8742_STATUS_READ_ERROR;
				/* Can't read from this device address 
				continue with next address */
				continue;
			}

			if((regvalue & LAN8742_SMR_PHY_ADDR) == addr)
			{
				pObj->DevAddr = addr;
				status = LAN8742_STATUS_OK;
				break;
			}
		}

		if(pObj->DevAddr > LAN8742_MAX_DEV_ADDR)
		{
			status = LAN8742_STATUS_ADDRESS_ERROR;
		}

		/* if device address is matched */
		if(status == LAN8742_STATUS_OK)
		{
			/* set a software reset  */
			if(pObj->IO.WriteReg(pObj->DevAddr, LAN8742_REG_BCR, LAN8742_BCR_RESET) >= 0)
			{ 
				/* get software reset status */
				if(pObj->IO.ReadReg(pObj->DevAddr, LAN8742_REG_BCR, &regvalue) >= 0)
				{ 
					tickstart = pObj->IO.GetTick();

					/* wait until software reset is done or timeout occured  */
					while(regvalue & LAN8742_BCR_RESET)
					{
						if((pObj->IO.GetTick() - tickstart) <= LAN8742_SW_RESET_TO)
						{
							if(pObj->IO.ReadReg(pObj->DevAddr, LAN8742_REG_BCR, &regvalue) < 0)
							{ 
								status = LAN8742_STATUS_READ_ERROR;
								break;
							}
						}
						else
						{
							status = LAN8742_STATUS_RESET_TIMEOUT;
						}
					} 
				}
				else
				{
					status = LAN8742_STATUS_READ_ERROR;
				}
			}
			else
			{
				status = LAN8742_STATUS_WRITE_ERROR;
			}
		}
	}
	
	if(status == LAN8742_STATUS_OK)
	{
		tickstart =  pObj->IO.GetTick();
		rt_kprintf("LAN8742A wait for initiializing... ...\n");
		/* Wait for 2s to perform initialization */
		while((pObj->IO.GetTick() - tickstart) <= LAN8742_INIT_TO)
		{
		}
		rt_kprintf("LAN8742A initiialized\n");
		pObj->Is_Initialized = 1;
	}

	return status;
}

/**
  * @brief  De-Initialize the lan8742 and it's hardware resources
  * @param  void. 
  * @retval LAN8742_STATUS_ERROR / LAN8742_STATUS_OK
  */
static int32_t LAN8742_DeInit(lan8742_Object_t *pObj)
{
	if(pObj->Is_Initialized)
	{
		if(pObj->IO.DeInit != 0)
		{
			if(pObj->IO.DeInit() < 0)
			{
				return LAN8742_STATUS_ERROR;
			}
		}

		pObj->Is_Initialized = 0;  
	}

	return LAN8742_STATUS_OK;
}

/**
  * @brief  Disable the LAN8742 power down mode.
  * @param  pObj: device object LAN8742_Object_t.  
  * @retval LAN8742_STATUS_OK  if OK
  *         LAN8742_STATUS_READ_ERROR if connot read register
  *         LAN8742_STATUS_WRITE_ERROR if connot write to register
  */
static int32_t LAN8742_DisablePowerDownMode(lan8742_Object_t *pObj)
{
	uint32_t readval = 0;
	int32_t status = LAN8742_STATUS_OK;

	if(pObj->IO.ReadReg(pObj->DevAddr, LAN8742_REG_BCR, &readval) >= 0)
	{
		readval &= ~LAN8742_BCR_POWER_DOWN;

		/* Apply configuration */
		if(pObj->IO.WriteReg(pObj->DevAddr, LAN8742_REG_BCR, readval) < 0)
		{
			status =  LAN8742_STATUS_WRITE_ERROR;
		}
	}
	else
	{
		status = LAN8742_STATUS_READ_ERROR;
	}

	return status;
}

/**
  * @brief  Enable the LAN8742 power down mode.
  * @param  pObj: device object LAN8742_Object_t.  
  * @retval LAN8742_STATUS_OK  if OK
  *         LAN8742_STATUS_READ_ERROR if connot read register
  *         LAN8742_STATUS_WRITE_ERROR if connot write to register
  */
static int32_t LAN8742_EnablePowerDownMode(lan8742_Object_t *pObj)
{
	uint32_t readval = 0;
	int32_t status = LAN8742_STATUS_OK;

	if(pObj->IO.ReadReg(pObj->DevAddr, LAN8742_REG_BCR, &readval) >= 0)
	{
		readval |= LAN8742_BCR_POWER_DOWN;

		/* Apply configuration */
		if(pObj->IO.WriteReg(pObj->DevAddr, LAN8742_REG_BCR, readval) < 0)
		{
			status =  LAN8742_STATUS_WRITE_ERROR;
		}
	}
	else
	{
		status = LAN8742_STATUS_READ_ERROR;
	}

	return status;
}

/**
  * @brief  Start the auto negotiation process.
  * @param  pObj: device object LAN8742_Object_t.  
  * @retval LAN8742_STATUS_OK  if OK
  *         LAN8742_STATUS_READ_ERROR if connot read register
  *         LAN8742_STATUS_WRITE_ERROR if connot write to register
  */
static int32_t LAN8742_StartAutoNego(lan8742_Object_t *pObj)
{
  uint32_t readval = 0;
  int32_t status = LAN8742_STATUS_OK;
  
  if(pObj->IO.ReadReg(pObj->DevAddr, LAN8742_REG_BCR, &readval) >= 0)
  {
    readval |= LAN8742_BCR_ANEG_EN;
  
    /* Apply configuration */
    if(pObj->IO.WriteReg(pObj->DevAddr, LAN8742_REG_BCR, readval) < 0)
    {
      status =  LAN8742_STATUS_WRITE_ERROR;
    }
  }
  else
  {
    status = LAN8742_STATUS_READ_ERROR;
  }
   
