wickkid/rt-thread/bsp/stm32h743-cllp/drivers/lan8742a.c
  return status;
}

/**
  * @brief  Get the link state of LAN8742 device.
  * @param  pObj: Pointer to device object. 
  * @param  pLinkState: Pointer to link state
  * @retval LAN8742_STATUS_LINK_DOWN  if link is down
  *         LAN8742_STATUS_AUTONEGO_NOTDONE if Auto nego not completed 
  *         LAN8742_STATUS_100MBITS_FULLDUPLEX if 100Mb/s FD
  *         LAN8742_STATUS_100MBITS_HALFDUPLEX if 100Mb/s HD
  *         LAN8742_STATUS_10MBITS_FULLDUPLEX  if 10Mb/s FD
  *         LAN8742_STATUS_10MBITS_HALFDUPLEX  if 10Mb/s HD       
  *         LAN8742_STATUS_READ_ERROR if connot read register
  *         LAN8742_STATUS_WRITE_ERROR if connot write to register
  */
static int32_t LAN8742_GetLinkState(lan8742_Object_t *pObj)
{
	uint32_t readval = 0;
  /*{
		rt_tick_t d = rt_tick_get();
		while ((rt_tick_get() - d) < (RT_TICK_PER_SECOND*2)) __nop();
	}*/
	/* Read Status register  */
	if(pObj->IO.ReadReg(pObj->DevAddr, LAN8742_REG_BSR, &readval) < 0)
	{
		return LAN8742_STATUS_READ_ERROR;
	}

	/* Read Status register again */
	if(pObj->IO.ReadReg(pObj->DevAddr, LAN8742_REG_BSR, &readval) < 0)
	{
		return LAN8742_STATUS_READ_ERROR;
	}

	if((readval & LAN8742_BSR_LINK_STAT) == 0)
	{
		/* Return Link Down status */
		return LAN8742_STATUS_LINK_DOWN;    
	}
  
	/* Check Auto negotiaition */
	if(pObj->IO.ReadReg(pObj->DevAddr, LAN8742_REG_BCR, &readval) < 0)
	{
		return LAN8742_STATUS_READ_ERROR;
	}
  
	if((readval & LAN8742_BCR_ANEG_EN) != LAN8742_BCR_ANEG_EN)
	{
		if(((readval & LAN8742_BCR_SPEED_SEL) == LAN8742_BCR_SPEED_SEL) && ((readval & LAN8742_BCR_DUPLEX) == LAN8742_BCR_DUPLEX)) 
		{
			return LAN8742_STATUS_100MBITS_FULLDUPLEX;
		}
		else if ((readval & LAN8742_BCR_SPEED_SEL) == LAN8742_BCR_SPEED_SEL)
		{
			return LAN8742_STATUS_100MBITS_HALFDUPLEX;
		}        
		else if ((readval & LAN8742_BCR_DUPLEX) == LAN8742_BCR_DUPLEX)
		{
			return LAN8742_STATUS_10MBITS_FULLDUPLEX;
		}
		else
		{
			return LAN8742_STATUS_10MBITS_HALFDUPLEX;
		}  		
	}
	else /* Auto Nego enabled */
	{
		if(pObj->IO.ReadReg(pObj->DevAddr, LAN8742_REG_PSCS, &readval) < 0)
		{
			return LAN8742_STATUS_READ_ERROR;
		}

		/* Check if auto nego not done */
		if((readval & LAN8742_PHYSCSR_AUTONEGO_DONE) == 0)
		{
			return LAN8742_STATUS_AUTONEGO_NOTDONE;
		}

		if((readval & LAN8742_PHYSCSR_HCDSPEEDMASK) == LAN8742_PHYSCSR_100BTX_FD)
		{
			return LAN8742_STATUS_100MBITS_FULLDUPLEX;
		}
		else if ((readval & LAN8742_PHYSCSR_HCDSPEEDMASK) == LAN8742_PHYSCSR_100BTX_HD)
		{
			return LAN8742_STATUS_100MBITS_HALFDUPLEX;
		}
		else if ((readval & LAN8742_PHYSCSR_HCDSPEEDMASK) == LAN8742_PHYSCSR_10BT_FD)
		{
			return LAN8742_STATUS_10MBITS_FULLDUPLEX;
		}
		else
		{
			return LAN8742_STATUS_10MBITS_HALFDUPLEX;
		}				
	}
}

/**
  * @brief  Set the link state of LAN8742 device.
  * @param  pObj: Pointer to device object. 
  * @param  pLinkState: link state can be one of the following
  *         LAN8742_STATUS_100MBITS_FULLDUPLEX if 100Mb/s FD
  *         LAN8742_STATUS_100MBITS_HALFDUPLEX if 100Mb/s HD
  *         LAN8742_STATUS_10MBITS_FULLDUPLEX  if 10Mb/s FD
  *         LAN8742_STATUS_10MBITS_HALFDUPLEX  if 10Mb/s HD   
  * @retval LAN8742_STATUS_OK  if OK
  *         LAN8742_STATUS_ERROR  if parameter error  
  *         LAN8742_STATUS_READ_ERROR if connot read register
  *         LAN8742_STATUS_WRITE_ERROR if connot write to register
  */
static int32_t LAN8742_SetLinkState(lan8742_Object_t *pObj, uint32_t LinkState)
{
	uint32_t bcrvalue = 0;
	int32_t status = LAN8742_STATUS_OK;

	if(pObj->IO.ReadReg(pObj->DevAddr, LAN8742_REG_BCR, &bcrvalue) >= 0)
	{
		/* Disable link config (Auto nego, speed and duplex) */
		bcrvalue &= ~(LAN8742_BCR_ANEG_EN | LAN8742_BCR_SPEED_SEL | LAN8742_BCR_DUPLEX);

		if(LinkState == LAN8742_STATUS_100MBITS_FULLDUPLEX)
		{
			bcrvalue |= (LAN8742_BCR_SPEED_SEL | LAN8742_BCR_DUPLEX);
		}
		else if (LinkState == LAN8742_STATUS_100MBITS_HALFDUPLEX)
		{
			bcrvalue |= LAN8742_BCR_SPEED_SEL;
		}
		else if (LinkState == LAN8742_STATUS_10MBITS_FULLDUPLEX)
		{
			bcrvalue |= LAN8742_BCR_DUPLEX;
		}
		else
		{
			/* Wrong link status parameter */
			status = LAN8742_STATUS_ERROR;
		}	
	}
	else
	{
		status = LAN8742_STATUS_READ_ERROR;
	}

	if(status == LAN8742_STATUS_OK)
	{
		/* Apply configuration */
		if(pObj->IO.WriteReg(pObj->DevAddr, LAN8742_REG_BCR, bcrvalue) < 0)
		{
			status = LAN8742_STATUS_WRITE_ERROR;
		}
	}

	return status;
}

/**
  * @brief  Enable loopback mode.
  * @param  pObj: Pointer to device object. 
  * @retval LAN8742_STATUS_OK  if OK
  *         LAN8742_STATUS_READ_ERROR if connot read register
  *         LAN8742_STATUS_WRITE_ERROR if connot write to register
  */
static int32_t LAN8742_EnableLoopbackMode(lan8742_Object_t *pObj)
{
	uint32_t readval = 0;
	int32_t status = LAN8742_STATUS_OK;

	if(pObj->IO.ReadReg(pObj->DevAddr, LAN8742_REG_BCR, &readval) >= 0)
	{
		readval |= LAN8742_BCR_LOOPBACK;

		/* Apply configuration */
		if(pObj->IO.WriteReg(pObj->DevAddr, LAN8742_REG_BCR, readval) < 0)
		{
			status = LAN8742_STATUS_WRITE_ERROR;
		}
	}
	else
	{
		status = LAN8742_STATUS_READ_ERROR;
	}

	return status;
}

/**
  * @brief  Disable loopback mode.
  * @param  pObj: Pointer to device object. 
  * @retval LAN8742_STATUS_OK  if OK
  *         LAN8742_STATUS_READ_ERROR if connot read register
  *         LAN8742_STATUS_WRITE_ERROR if connot write to register
  */
static int32_t LAN8742_DisableLoopbackMode(lan8742_Object_t *pObj)
{
	uint32_t readval = 0;
	int32_t status = LAN8742_STATUS_OK;

	if(pObj->IO.ReadReg(pObj->DevAddr, LAN8742_REG_BCR, &readval) >= 0)
	{
		readval &= ~LAN8742_BCR_LOOPBACK;

		/* Apply configuration */
		if(pObj->IO.WriteReg(pObj->DevAddr, LAN8742_REG_BCR, readval) < 0)
		{
			status =  LAN8742_STATUS_WRITE_ERROR;
		}
	}
	else
	{
		status = LAN8742_STATUS_READ_ERROR;
	}

	return status;
}

/**
  * @brief  Enable IT source.
  * @param  pObj: Pointer to device object. 
  * @param  Interrupt: IT source to be enabled
  *         should be a value or a combination of the following:
  *         LAN8742_WOL_IT                     
  *         LAN8742_ENERGYON_IT                
  *         LAN8742_AUTONEGO_COMPLETE_IT       
  *         LAN8742_REMOTE_FAULT_IT            
  *         LAN8742_LINK_DOWN_IT               
  *         LAN8742_AUTONEGO_LP_ACK_IT         
  *         LAN8742_PARALLEL_DETECTION_FAULT_IT
  *         LAN8742_AUTONEGO_PAGE_RECEIVED_IT
  * @retval LAN8742_STATUS_OK  if OK
  *         LAN8742_STATUS_READ_ERROR if connot read register
  *         LAN8742_STATUS_WRITE_ERROR if connot write to register
  */
static int32_t LAN8742_EnableIT(lan8742_Object_t *pObj, uint32_t Interrupt)
{
  uint32_t readval = 0;
  int32_t status = LAN8742_STATUS_OK;
  
  if(pObj->IO.ReadReg(pObj->DevAddr, LAN8742_REG_IM, &readval) >= 0)
  {
    readval |= Interrupt;
  
    /* Apply configuration */
    if(pObj->IO.WriteReg(pObj->DevAddr, LAN8742_REG_IM, readval) < 0)
    {
      status =  LAN8742_STATUS_WRITE_ERROR;
    }
  }
  else
  {
    status = LAN8742_STATUS_READ_ERROR;
  }
   
