wickkid/rt-thread/bsp/stm32h743-cllp/drivers/lan8742a.c
  return status;
}

/**
  * @brief  Disable IT source.
  * @param  pObj: Pointer to device object. 
  * @param  Interrupt: IT source to be disabled
  *         should be a value or a combination of the following:
  *         LAN8742_WOL_IT                     
  *         LAN8742_ENERGYON_IT                
  *         LAN8742_AUTONEGO_COMPLETE_IT       
  *         LAN8742_REMOTE_FAULT_IT            
  *         LAN8742_LINK_DOWN_IT               
  *         LAN8742_AUTONEGO_LP_ACK_IT         
  *         LAN8742_PARALLEL_DETECTION_FAULT_IT
  *         LAN8742_AUTONEGO_PAGE_RECEIVED_IT
  * @retval LAN8742_STATUS_OK  if OK
  *         LAN8742_STATUS_READ_ERROR if connot read register
  *         LAN8742_STATUS_WRITE_ERROR if connot write to register
  */
static int32_t LAN8742_DisableIT(lan8742_Object_t *pObj, uint32_t Interrupt)
{
  uint32_t readval = 0;
  int32_t status = LAN8742_STATUS_OK;
  
  if(pObj->IO.ReadReg(pObj->DevAddr, LAN8742_REG_IM, &readval) >= 0)
  {
    readval &= ~Interrupt;
  
    /* Apply configuration */
    if(pObj->IO.WriteReg(pObj->DevAddr, LAN8742_REG_IM, readval) < 0)
    {
      status = LAN8742_STATUS_WRITE_ERROR;
    }
  }
  else
  {
    status = LAN8742_STATUS_READ_ERROR;
  }
   
  return status;
}

/**
  * @brief  Clear IT flag.
  * @param  pObj: Pointer to device object. 
  * @param  Interrupt: IT flag to be cleared
  *         should be a value or a combination of the following:
  *         LAN8742_WOL_IT                     
  *         LAN8742_ENERGYON_IT                
  *         LAN8742_AUTONEGO_COMPLETE_IT       
  *         LAN8742_REMOTE_FAULT_IT            
  *         LAN8742_LINK_DOWN_IT               
  *         LAN8742_AUTONEGO_LP_ACK_IT         
  *         LAN8742_PARALLEL_DETECTION_FAULT_IT
  *         LAN8742_AUTONEGO_PAGE_RECEIVED_IT
  * @retval LAN8742_STATUS_OK  if OK
  *         LAN8742_STATUS_READ_ERROR if connot read register
  */
static int32_t  LAN8742_ClearIT(lan8742_Object_t *pObj, uint32_t Interrupt)
{
  uint32_t readval = 0;
  int32_t status = LAN8742_STATUS_OK;  
  
  if(pObj->IO.ReadReg(pObj->DevAddr, LAN8742_REG_ISF, &readval) < 0)
  {
    status =  LAN8742_STATUS_READ_ERROR;
  }
  
  return status;
}

/**
  * @brief  Get IT Flag status.
  * @param  pObj: Pointer to device object. 
  * @param  Interrupt: IT Flag to be checked, 
  *         should be a value or a combination of the following:
  *         LAN8742_WOL_IT                     
  *         LAN8742_ENERGYON_IT                
  *         LAN8742_AUTONEGO_COMPLETE_IT       
  *         LAN8742_REMOTE_FAULT_IT            
  *         LAN8742_LINK_DOWN_IT               
  *         LAN8742_AUTONEGO_LP_ACK_IT         
  *         LAN8742_PARALLEL_DETECTION_FAULT_IT
  *         LAN8742_AUTONEGO_PAGE_RECEIVED_IT  
  * @retval 1 IT flag is SET
  *         0 IT flag is RESET
  *         LAN8742_STATUS_READ_ERROR if connot read register
  */
static int32_t LAN8742_GetITStatus(lan8742_Object_t *pObj, uint32_t Interrupt)
{
  uint32_t readval = 0;
  int32_t status = 0;

  if(pObj->IO.ReadReg(pObj->DevAddr, LAN8742_REG_ISF, &readval) >= 0)
  {
    status = ((readval & Interrupt) == Interrupt);
  }
  else
  {
    status = LAN8742_STATUS_READ_ERROR;
  }
	
  return status;
}

static rt_err_t rt_lan8742_init(rt_device_t dev)
{
	int32_t PHYLinkState;
	PHYLinkState = LAN8742_GetLinkState(&LAN8742);
	if(PHYLinkState <= LAN8742_STATUS_LINK_DOWN)
	{
		eth_device_linkchange(&lan8742_device.parent, RT_FALSE);

	}
	else{
		rt_kprintf("link up\n");
		eth_device_linkchange(&lan8742_device.parent, RT_TRUE);
	}
	return RT_EOK;
}

static rt_err_t rt_lan8742_open(rt_device_t dev, rt_uint16_t oflag)
{
	return RT_EOK;
}

static rt_err_t rt_lan8742_close(rt_device_t dev)
{
	LAN8742_DeInit(&LAN8742);
	LAN8742_DisableIT(&LAN8742, LAN8742_INT_ALL);
	LAN8742_EnablePowerDownMode(&LAN8742);

    return RT_EOK;
}

static rt_size_t rt_lan8742_read(rt_device_t dev, rt_off_t pos, void* buffer, rt_size_t size)
{
	rt_set_errno(-RT_ENOSYS);
    return 0;
}

static rt_size_t rt_lan8742_write (rt_device_t dev, rt_off_t pos, const void* buffer, rt_size_t size)
{
	rt_set_errno(-RT_ENOSYS);
    return 0;
}

static rt_err_t rt_lan8742_control(rt_device_t dev, int cmd, void *args)
{
	switch (cmd)
	{
		case NIOCTL_GADDR:
			/* get mac address */
			if (args)
				rt_memcpy(args, lan8742_device.dev_addr, 6);
			else
				return -RT_ERROR;
			break;
		default :
			break;
	}

	return RT_EOK;
}

/* ethernet device interface */
/* transmit packet. */
rt_err_t rt_lan8742_tx( rt_device_t dev, struct pbuf* p)
{
	uint32_t i=0, framelen = 0;
	struct pbuf *q;
	err_t errval = ERR_OK;
	ETH_BufferTypeDef Txbuffer[ETH_TX_DESC_CNT];
  
	/* lock LAN8742 device */
  rt_sem_take(&sem_lock, RT_WAITING_FOREVER);
	
	memset(Txbuffer, 0 , 4*sizeof(ETH_BufferTypeDef));

	for(q = p; q != NULL; q = q->next)
	{
		if(i >= ETH_TX_DESC_CNT)	
			return ERR_IF;

		Txbuffer[i].buffer = q->payload;
		Txbuffer[i].len = q->len;
		framelen += q->len;

		if(i>0)
		{
			Txbuffer[i-1].next = &Txbuffer[i];
		}

		i++;
	}

	TxConfig.Length = framelen;
	TxConfig.TxBuffer = Txbuffer;

	/* Clean and Invalidate data cache */
	SCB_CleanInvalidateDCache();  

	HAL_ETH_Transmit(&EthHandle, &TxConfig, 0);//Transmit an ETH frame in blocking mode

	/* unlock LAN8742 device */
	rt_sem_release(&sem_lock);

    return errval;
}

/* reception packet. */
struct pbuf *rt_lan8742_rx(rt_device_t dev)
{
	struct pbuf* p = RT_NULL;
	ETH_BufferTypeDef RxBuff;
	uint32_t framelength = 0;
	
    /* lock LAN8742 device */
    rt_sem_take(&sem_lock, RT_WAITING_FOREVER);
	
	/* Clean and Invalidate data cache */
	SCB_CleanInvalidateDCache();

	if(HAL_ETH_GetRxDataBuffer(&EthHandle, &RxBuff) == HAL_OK) 
	{
		HAL_ETH_GetRxDataLength(&EthHandle, &framelength);
		
		  p = pbuf_alloc(PBUF_LINK, framelength, PBUF_RAM);
			if (p)
			{
				/* copy to the pbuf */
					//pbuf_take(p, (void*)(desc->buffer1 | 0xa0000000), length);
					//rt_hw_dcache_invalidate_range((rt_ubase_t)(desc->buffer1), length);
					//pbuf_take(p, (void*)(desc->buffer1), length);
					pbuf_take(p, (void*)RxBuff.buffer, framelength);    
			}
			else
			{
					rt_kprintf("alloc rx pbuf failed\n");
			}
				
		/*p = pbuf_alloced_custom(PBUF_RAW, framelength, PBUF_POOL, &rx_pbuf[current_pbuf_idx], RxBuff.buffer, framelength);

		if(current_pbuf_idx < (ETH_RX_DESC_CNT -1))
		{
			current_pbuf_idx++;
		}
		else
		{
			current_pbuf_idx = 0;
		}*/
	}
	HAL_ETH_BuildRxDescriptors(&EthHandle);
	
  /* unlock LAN8742 device */
  rt_sem_release(&sem_lock);

  return p;
}

/**
  * @brief  Custom Rx pbuf free callback
  * @param  pbuf: pbuf to be freed
  * @retval None
  */
static void pbuf_free_custom(struct pbuf *p)
{
	if(p != NULL)
	{
		p->flags = 0;
		p->next = NULL;
		p->len = p->tot_len = 0;
		p->ref = 0;
		p->payload = NULL;
	}
}

int rt_hw_lan8742a_init(void)
{
	uint32_t idx, duplex, speed = 0;
	int32_t PHYLinkState;
	ETH_MACConfigTypeDef MACConf;
	uint8_t macaddress[6]= {ETH_MAC_ADDR0, ETH_MAC_ADDR1, ETH_MAC_ADDR2, 
	                        ETH_MAC_ADDR3, ETH_MAC_ADDR4, ETH_MAC_ADDR5};

