wickkid/rt-thread/bsp/stm32h743-cllp/drivers/lan8742a.c
	EthHandle.Instance = ETH;  
	EthHandle.Init.MACAddr = macaddress;
	EthHandle.Init.MediaInterface = HAL_ETH_RMII_MODE;
	EthHandle.Init.RxDesc = DMARxDscrTab;
	EthHandle.Init.TxDesc = DMATxDscrTab;
	EthHandle.Init.RxBuffLen = ETH_MAX_PACKET_SIZE;

	/* configure ethernet peripheral (GPIOs, clocks, MAC, DMA) */
	HAL_ETH_Init(&EthHandle);
  
	for(idx = 0; idx < ETH_RX_DESC_CNT; idx ++)
	{
		HAL_ETH_DescAssignMemory(&EthHandle, idx, Rx_Buff[idx], NULL);

		/* Set Custom pbuf free function */
		//rx_pbuf[idx].custom_free_function = pbuf_free_custom;
	}
	
	rt_memset(&TxConfig, 0 , sizeof(ETH_TxPacketConfig));  
	TxConfig.Attributes = ETH_TX_PACKETS_FEATURES_CSUM | ETH_TX_PACKETS_FEATURES_CRCPAD;
	TxConfig.ChecksumCtrl = ETH_CHECKSUM_IPHDR_PAYLOAD_INSERT_PHDR_CALC;
	TxConfig.CRCPadCtrl = ETH_CRC_PAD_INSERT;
	
	/* Initialize the LAN8742 ETH PHY */
	LAN8742_Init(&LAN8742);

	/* Get link state */  
	PHYLinkState = LAN8742_GetLinkState(&LAN8742);

	/* Get link state */  
	if(PHYLinkState <= LAN8742_STATUS_LINK_DOWN)
	{
		//
	}
	else 
	{
		rt_kprintf("link state success\n");
		switch (PHYLinkState)
		{
			case LAN8742_STATUS_100MBITS_FULLDUPLEX:
				duplex = ETH_FULLDUPLEX_MODE;
				speed = ETH_SPEED_100M;
				break;
			case LAN8742_STATUS_100MBITS_HALFDUPLEX:
				duplex = ETH_HALFDUPLEX_MODE;
				speed = ETH_SPEED_100M;
				break;
			case LAN8742_STATUS_10MBITS_FULLDUPLEX:
				duplex = ETH_FULLDUPLEX_MODE;
				speed = ETH_SPEED_10M;
				break;
			case LAN8742_STATUS_10MBITS_HALFDUPLEX:
				duplex = ETH_HALFDUPLEX_MODE;
				speed = ETH_SPEED_10M;
				break;
			default:
				duplex = ETH_FULLDUPLEX_MODE;
				speed = ETH_SPEED_100M;
				break;      
		}

		/* Get MAC Config MAC */
		HAL_ETH_GetMACConfig(&EthHandle, &MACConf); 
		MACConf.DuplexMode = duplex;
		MACConf.Speed = speed;
		HAL_ETH_SetMACConfig(&EthHandle, &MACConf);
		HAL_ETH_Start_IT(&EthHandle);
	}
	
  rt_sem_init(&sem_lock, "eth_lock", 1, RT_IPC_FLAG_FIFO);
	
	rt_memcpy(lan8742_device.dev_addr, macaddress, 6);
	
	lan8742_device.parent.parent.init       = rt_lan8742_init;
	lan8742_device.parent.parent.open       = rt_lan8742_open;
	lan8742_device.parent.parent.close      = rt_lan8742_close;
	lan8742_device.parent.parent.read       = rt_lan8742_read;
	lan8742_device.parent.parent.write      = rt_lan8742_write;
	lan8742_device.parent.parent.control    = rt_lan8742_control;
	lan8742_device.parent.parent.user_data  = RT_NULL;

	lan8742_device.parent.eth_rx     = rt_lan8742_rx;
	lan8742_device.parent.eth_tx     = rt_lan8742_tx;

	eth_device_init(&(lan8742_device.parent), "e0");
	
    return 0;
}
INIT_DEVICE_EXPORT(rt_hw_lan8742a_init);


#ifdef  RT_USING_LWIP
/**
  * @brief  This function handles Ethernet interrupt request.
  * @param  None
  * @retval None
  */
void ETH_IRQHandler(void)
{
	HAL_ETH_IRQHandler(&EthHandle);
}
#endif /* RT_USING_LWIP */

/**
  * @brief  Ethernet Rx Transfer completed callback
  * @param  heth: ETH handle
  * @retval None
  */
void HAL_ETH_RxCpltCallback(ETH_HandleTypeDef *heth)
{
	/* a frame has been received */
	eth_device_ready(&(lan8742_device.parent));
}

#endif

